posts/2018-11-04-prayer-for-pittsburgh.org
#+title: Prayer for Pittsburgh
#+date: <2018-11-04>
#+filetags: prayer religion

God of Grace, God of Mercy, We pray today for the people\\
of the Tree of Life congregation\\
in Pittsburgh. We pray for all those\\
who suffer from violence,\\
for those who grieve,\\
and for those who have died\\
because of a hatred that\\
has no point,\\
and makes no sense. May they find comfort in\\
the knowledge of your love,\\
and healing in the support\\
of the community. We ask forgiveness\\
for the ways in which\\
your word has been twisted\\
to support acts of evil. Give us the courage\\
to challenge the evil rhetoric\\
that supports hatred and violence,\\
and to speak the truth boldly,\\
that your love, grace, and mercy\\
extend to all without limit. May the love of your people do the same.

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
