docs/posts/2018-11-04-prayer-for-pittsburgh.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Pittsburgh</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Pittsburgh</h1>
<p class="subtitle" role="doc-subtitle">Nov 04, 2018</p>
</header><p>
God of Grace, God of Mercy, We pray today for the people<br>
of the Tree of Life congregation<br>
in Pittsburgh. We pray for all those<br>
who suffer from violence,<br>
for those who grieve,<br>
and for those who have died<br>
because of a hatred that<br>
has no point,<br>
and makes no sense. May they find comfort in<br>
the knowledge of your love,<br>
and healing in the support<br>
of the community. We ask forgiveness<br>
for the ways in which<br>
your word has been twisted<br>
to support acts of evil. Give us the courage<br>
to challenge the evil rhetoric<br>
that supports hatred and violence,<br>
and to speak the truth boldly,<br>
that your love, grace, and mercy<br>
extend to all without limit. May the love of your people do the same.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
